package com.bt.heynath.shreemukhi;

import android.graphics.Typeface;
import android.os.Bundle;

import com.google.android.material.floatingactionbutton.FloatingActionButton;
import com.google.android.material.snackbar.Snackbar;

import androidx.annotation.NonNull;
import androidx.appcompat.app.AppCompatActivity;
import androidx.appcompat.widget.Toolbar;

import android.view.MenuItem;
import android.view.View;
import android.widget.TextView;

import com.bt.heynath.R;

public class ViewDetails extends AppCompatActivity {

    public static String menu;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_view_details);
        //Toolbar toolbar = findViewById(R.id.toolbar);
       // setSupportActionBar(toolbar);


        getSupportActionBar().setHomeButtonEnabled(true);
        getSupportActionBar().setDisplayHomeAsUpEnabled(true);

        TextView txt;
        txt=findViewById(R.id.txt);

        if(menu.equalsIgnoreCase("Mahima")) {
            getSupportActionBar().setTitle("*गीता जी की महिमा*");
            txt.setText("\t\tप्रत्येक मनुष्य को अपने कल्याण का जन्मसिद्ध अधिकार है। गीता में परमार्थ का सरल " +
                    "रास्ता दिखलाया गया है। गीता भगवान कृष्ण के मुख की वाणी तथा वेदव्यासजी द्वारा " +
                    "लिखित सर्वोपरि भारतीय ग्रंथ है। गीता को कंठस्थ व हृदयस्थ करने से मन को अथाह " +
                    "शांति तथा जीवन के समुचित प्रबंधन की सीख मिलती है। इसलिए प्रत्येक मनुष्य को" +
                    "गीता का अवश्य नित्य अभ्यास करना चाहिए |\n" +
                    "\t\tगीता ग्रंथ की रचना विक्रम संवत से पहले लगभग 3000 वर्ष पूर्व की मानी जाती है। यह " +
                    "मार्गशीर्ष शुक्ल एकादशी के दिन रविवार को भगवान श्रीकृष्ण के मुखारबिन्द से निकली " +
                    "हुई दिव्य वाणी है। इसी दिन गीता जयंती के रूप में मनाया जाता है इसके श्रोता अर्जुन " +
                    "तथा संकलनकर्ता महर्षि वेदव्यासजी मुनि तथा लेखक भगवान गणेशजी है।\n" +
                    "\t\tमहाभारत के भीष्म पर्व के 25 से 42 अध्याय तक गीता का वर्णन हुआ है। संपूर्ण " +
                    "वेदों का सार उपनिषद्\u200C है और उपनिषदों का सार गीता है। गीता एक बहुत ही अलौकिक " +
                    "विचित्र सार्वभौमिक ग्रंथ है। यह श्लोकों के रूप में है, और भगवान की वाणी होने के " +
                    "कारण वेद क्रचाओं के समान मंत्र रूप है। इसकी भाषा सरल होने पर भी आशय गंभीर " +
                    "होने से यह सुत्र रूप से है इसकी महिमा अगाध ओर असीम है। इसमें पारमार्थिक व जीवन " +
                    "उपयोगी पूरी सामग्री मिलती है, चाहे वह किसी भी वर्णाश्रम का व्यक्ति क्\u200Dयों न हो।\n" +
                    "\t\tगीता में वास्तविक तत्व परमात्मा का ही वर्णन हुआ है। गीता साक्षात भगवान का " +
                    "हृदय है। सभी धर्म संप्रदाय के लोग इसका आदर करते है। यह संपूर्ण शास्त्रों का सार है," +
                    "जो अपने वर्णाश्रम तथा धर्म को कर्तव्य समझकर निष्काम भाव से अनुष्ठान करता है, वह " +
                    "भगवत प्राप्ति का अधिकारी हो जाता है। गीता का आश्रय लेकर पाठ करने मात्र से बड़े " +
                    "विचित्र अलौकिक और शांति दायक भाव स्फ्रित होते है। गीता का तात्पर्य मनुष्य मात्र " +
                    "का कल्याण करना है, गीता का सर्वापरि सिद्धांत “वासुदेव सर्वम” अर्थात सब कुछ भगवान " +
                    "ही है। मन में कोई शंका होती है तो गीता का पाठ करते करते समाधान हो जाता है। यह " +
                    "एक प्रासादिक ग्रंथ है। श्री कृष्ण अर्जुन संवाद के रूप में 8 अध्याय जिसमें 700 श्लोक " +
                    "का ग्रंथ श्रीमद्भगवद्गीता के नाम से जाना जाता है| गीता जी की पुस्तक भगवत्\u200C स्वरूप है| \n" +
                    "\t\tअत: उसका विशेषता से आदर करना चाहिए। गीताजी की पुस्तक को हमेशा शुद्ध स्थान पर" +
                    "ही रखना चाहिए। यहां तक संतों ने यह भी कहा है कि गीताजी की पुस्तक को कभी बाएं" +
                    "हाथ से नहीं पकड़ना चाहिए। हमेशा दाएं हाथ से ही पकड़ना चाहिए| गीता के झूठे व" +
                    "अशुद्ध हाथ नहीं लगाने चाहिए। माता बहनों को भी मासिक धर्म के समय इसको नहीं छूना" +
                    "चाहिए, जो मनुष्य निराभिमानी होकर सरलता पूर्वक गीता की शरण में जाता है, उसको" +
                    "भगवान अपनी शरण में ले लेते है व अपना प्रेम प्रदान कर देते है।"
            );
        }
        if(menu.equalsIgnoreCase("18 Names"))
        {
            getSupportActionBar().setTitle("* गीता जी के 18 नाम*");
            txt.setText("गीता गड़्ा च गायत्री सीता सत्या " +
                    "सरस्वती।\n" +
                    "ब्रह्मविद्या ब्रह्मवल्ली त्रिसन्ध्या " +
                    "मुक्तिगेहिनी ॥\n" +
                    "अर्धमात्रा चिदानन्दा भवघ्नी भयनाशिनी।\n" +
                    "वेदत्रयी परानन्ता तत्त्वार्थज्ञानमज्जरी ॥\n" +
                    "इत्येतानि जपेन्नित्यं नरो निशचलमानसः ।\n" +
                    "ज्ञानसिद्धि लभेच्छीप्र॑ं तथान्ते परमं पदम्\u200C॥");
        }
        if(menu.equalsIgnoreCase("5 Shlok"))
        {
            getSupportActionBar().setTitle("* नित्य पठनिय पांच श्लोक *");
            getSupportActionBar().setSubtitle("(श्रीमदभगवदगीता के अध्याय 4 के श्लोक 6 से 10 तक)");
            txt.setText("अजो5पि सन्\u200Cू-नव्ययात्मा, भूताना-मीश्वरोषपि सन्\u200C।\n" +
                    "प्रकृतिं स्वा-मधिएठाय, सम्भवा-म्यात्म-मायया । 6 ।।\n" +
                    "मैं अजन्मा और अविनाशी-स्वरूप होते हुए भी तथा सम्पूर्ण प्राणियोंका\n" +
                    "ईश्वर होते हुए भी अपनी प्रकृतिको अधीन करके अपनी योगमायासे प्रकट\n" +
                    "होता हूँ।\n" +
                    "यदा यदा हि धर्मस्य, ग्लानिर्\u200C-भवति भारत।\n" +
                    "अभ्युत्थान-मधर्मस्य, तदात्मानं सृजाम्यहमू। 7 ।।\n" +
                    "हे भरतवंशी अर्जुन! जब-जब धर्मकी हानि और अधर्मकी वृद्धि होती है,\n" +
                    "तब-तब ही मैं अपने-आपको (साकार रूपसे) प्रकट करता हूँ।\n" +
                    "परित्राणाय साधूनां, विनाशाय च दुष्कृताम्\u200C।\n" +
                    "धर्म-संस्थाप-नार्थाय, सम्भवामि युगे युगे ।।8।।\n" +
                    "साधुओं (भक्\u200D्तों)-की रक्षा करनेके लिये, पापकर्म करनेवालोंका विनाश करनेके\n" +
                    "लिए और धर्मकी भली-भाँति स्थापना करनेके लिये मैं युग-युगमें प्रकट हुआ\n" +
                    "करता हूँ।\n" +
                    "जन्म कर्मजन्म कर्म च मे दिव्य,-मेवं यो जेत्ति तत्त्वतः।\n" +
                    "त्यक्ता देहं पुनर्जन्म, नेति मामेति सो्र्जुन।।9।।\n" +
                    "हे अर्जुन! मेरे जन्म और कर्म दिव्य हैं। इस प्रकार (मेरे जन्म और कर्मको) जो\n" +
                    "मनुष्य तत्त्वसे जान लेता है अर्थात्\u200C दृढ़तापूर्वक मान लेता है, वह शरीरका त्याग\n" +
                    "करके पुनर्जन्मको प्राप्त नहीं होता, प्रत्युत मुझे प्राप्त होता है।\n" +
                    "वीतराग-भय-क्रो शा, मन्\u200D्मया मामुपाभिताः।\n" +
                    "बहवो ज्ञान-तपसा, पूता मद्\u200C-भाव-मागताः ।।0।।\n" +
                    "राग, भय और क्रोधसे सर्वथा रहित, मुझमें तल्\u200D्लीन, मेरे ही आश्रित तथा\n" +
                    "ज्ञानरूप तपसे पवित्र हुए बहुत-से भक्त मेरे स्वरूपको प्राप्त हो चुके हैं।\n" +
                    "हे नाथ ! हे मेरे नाथ ! मैं आपको भूल नहीं !"+
                    "\nपंचामृत\n" +
                    "१.हम भगवानके ही हैं |\n" +
                    "२.हम जहां भी रहते हैं, भगवान्\u200Cके दरबार में ही रहते हैं।\n" +
                    "३.हम जो भी शुभ काम करते हैं, भगवान्\u200Cका ही काम करते हैं।\n" +
                    "४.शुद्ध-सात्विक जो भी पाते हैं, भगवान्\u200Cका ही प्रसाद पाते हैं।\n" +
                    "५.भगवानके दिए प्रसादसे भगवानके ही जनोंकी सेवा करते हैं।"                     );
        }
        if(menu.equalsIgnoreCase("Geeta Sar"))
        {
            getSupportActionBar().setTitle("*गीता सार*");
            txt.setText("१.सांसारिक मोहके कारण ही मनुष्य 'मैं क्\u200Dया करूँ और क्या नहीं करूँ इस दुविधा " +
                    "में फँसकर कर्तव्यच्युत हो जाता है। अत: मोह या सुखासक्ति के वशीभूत नहीं होना " +
                    "चाहिए |\n" +
                    "2. शरीर नाशवान्\u200C हैं और उसे जानने वाला शरीरी अविनाशी है- इस विवेक को महत्व " +
                    "देना और अपने कर्तव्यका पालन करना- इन दोनों में से किसी भी एक उपाय को " +
                    "काम में लाने से चिन्ता-शोक मिट जाते हैं।\n" +
                    "3. निष्कामभावपूर्वक केवल दूसरों के हित के लिये अपने कर्तव्य का तत्परता से पालन " +
                    "करनेमात्रसे कल्याण हो जाता हैं|\n" +
                    "4. कर्मबन्धनसे छूटनेके दो उपाय हैं- कर्मोके तत्वको जानकर निःस्वार्थभावसे कर्म करना" +
                    "और तत्वज्ञान का अनुभव करना |\n" +
                    "5. मनुष्य को अनुकूल-प्रतिकूल परिस्थितियों के आने पर सुखी-दुःखी नहीं होना चाहिये " +
                    "क्योंकि इनसे सुखी-दुखी होने वाला मनुष्य संसार से ऊँचा उठकर परम आनन्दका " +
                    "अनुभव नहीं कर सकता |\n" +
                    "6. किसी भी साधन से अन्तःकरण में समता आनी चाहिये। समता आये बिना मनुष्य" +
                    "सर्वथा निर्विकार नहीं हो सकता |\n" +
                    "7. सब कुछ भगवान्\u200C ही हैं- ऐसा स्वीकार कर लेना सर्वश्रेष्ठ साधन हैं|\n" +
                    "8. अन्तकालीन चिन्तन के अनुसार ही जीव की गति होती है। अत: मनुष्य को हर दम\n" +
                    "भगवान्\u200C का स्मरण करते हुए अपने कर्तव्यका पालन करना चाहिये, जिससे " +
                    "अन्तकाल में भगवान्\u200C की स्मृति बनी रहे।\n" +
                    "9. सभी मनुष्य भगवत्प्राप्तिके अधिकारी हैं, चाहे वे किसी भी वर्ण, आश्रम, सम्प्रदाय " +
                    "देश, वेश आदि के क्\u200Dयों न हो |\n" +
                    "१0. संसार में जहाँ भी विलक्षणता, विशेषता, सुन्दरता, महता, विद्वता आदि दिखे, उसको " +
                    "भगवान्\u200Cका ही मानकर भगवानका ही चिन्तन करना चाहिये |\n" +
                    "११. इस जगत्\u200Cको भगवान का ही स्वरूप मानकर प्रत्येक मनुष्य भगवान्\u200Cके विराटरूपके " +
                    "दर्शन कर सकता है|\n" +
                    "१2. जो भक्त शरीर-इन्द्रियाँ-गन-बुद्धिसहित अपने आपको भगवान्\u200C के अर्पण कर देता है, " +
                    "वह भगवानूको प्रिय होता है।\n" +
                    "१3. संसार में एक परमात्मतत्व ही जानने योग्य है। उसको जानने पर अमरता की प्राप्ति हो " +
                    "जाती है।\n");
        }
        Typeface tf=Typeface.createFromAsset(this. getAssets(), "Roboto-Light.ttf");
        txt.setTypeface(tf);
    }

    @Override
    public boolean onOptionsItemSelected(@NonNull MenuItem item) {
        if(item.getItemId()==android.R.id.home)
        {
            onBackPressed();
        }
        return super.onOptionsItemSelected(item);
    }

}
